---
type: RebarContainerParameterManager
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 15
tags: [revit-api, class]
---

# RebarContainerParameterManager

`Autodesk.Revit.DB.Structure.RebarContainerParameterManager` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddOverride | — | `` |
| Method | AddSharedParameterAsOverride | 2016 | `public void AddSharedParameterAsOverride ( ElementId paramId )` |
| Method | ClearOverrides | 2016 | `public void ClearOverrides ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDoubleOverrideValue | 2018 | `public double GetDoubleOverrideValue ( ElementId paramId )` |
| Method | GetElementIdOverrideValue | 2018 | `public ElementId GetElementIdOverrideValue ( ElementId paramId )` |
| Method | GetIntOverrideValue | 2018 | `public int GetIntOverrideValue ( ElementId paramId )` |
| Method | GetStringOverrideValue | 2018 | `public string GetStringOverrideValue ( ElementId paramId )` |
| Method | IsOverriddenParameterModifiable | 2016 | `public bool IsOverriddenParameterModifiable ( ElementId paramId )` |
| Method | IsParameterOverridden | 2016 | `public bool IsParameterOverridden ( ElementId paramId )` |
| Method | IsRebarContainerParameter | 2016 | `public bool IsRebarContainerParameter ( ElementId paramId )` |
| Method | RemoveOverride | 2016 | `public void RemoveOverride ( ElementId paramId )` |
| Method | SetOverriddenParameterModifiable | 2016 | `public void SetOverriddenParameterModifiable ( ElementId paramId )` |
| Method | SetOverriddenParameterReadonly | 2016 | `public void SetOverriddenParameterReadonly ( ElementId paramId )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |